Revit 2026 API

# FailuresAccessorGetDocument Method

---

Provides access to a document for which failures are being processed or preprocessed.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Document GetDocument()
```
```vb
Public Function GetDocument As Document
```
```cpp
public:
Document^ GetDocument()
```
```fsharp
member GetDocument : unit -> Document
```

#### Return Value

Document The document for which failures preprocessing or processing is being performed.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailuresAccessor is inactive (is used outside of failures processing). |

#### Reference

FailuresAccessor Class

Autodesk.Revit.DB Namespace